In [1]:
import pandas as pd

In [2]:
data = {
'Shop_Name': ['Starbucks', 'Blue Bottle', 'Dunkin', 'Peets', 'Starbucks', 'La Colombe', 'Blue Bottle', 'Peets', 'Starbucks', 'Dunkin'],
'Location': ['Hollywood', 'San Diego', 'San Diego', 'Hollywood', 'New York', 'New York', 'Hollywood', 'San Diego', 'New York', 'Hollywood'],
'Rating': [4.5, 4.7, 4.1, 4.3, 4.5, 4.8, 4.6, 4.2, 4.4, 3.9],
'Type': ['Chain', 'Independent', 'Chain', 'Chain', 'Chain', 'Independent', 'Independent', 'Chain', 'Chain', 'Chain']
}

In [3]:
coffee_shops = pd.DataFrame(data)

In [4]:
coffee_shops

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

### 1) Group by both Location and Type. How many independent coffee shops are there in 'San Diego'?

In [5]:
coffee_shops.groupby(['Location', 'Type']).count()

                       Shop_Name  Rating
Location  Type
Hollywood Chain                3       3
          Independent          1       1
New York  Chain                2       2
          Independent          1       1
San Diego Chain                2       2
          Independent          1       1

In [6]:
coffee_shops.groupby(['Location', 'Type']).count()['Shop_Name'].loc[('San Diego', 'Independent')]

1

### 2) Group by Shop_Name and Location. Which shop-location combination has the highest average rating?

In [7]:
rating_means = coffee_shops.groupby(['Shop_Name', 'Location']).agg({'Rating': 'mean'})

In [8]:
rating_means

                       Rating
Shop_Name   Location
Blue Bottle Hollywood    4.60
            San Diego    4.70
Dunkin      Hollywood    3.90
            San Diego    4.10
La Colombe  New York     4.80
Peets       Hollywood    4.30
            San Diego    4.20
Starbucks   Hollywood    4.50
            New York     4.45

In [9]:
rating_means_sorted = rating_means.sort_values('Rating', ascending=False)

In [10]:
rating_means_sorted

                       Rating
Shop_Name   Location
La Colombe  New York     4.80
Blue Bottle San Diego    4.70
            Hollywood    4.60
Starbucks   Hollywood    4.50
            New York     4.45
Peets       Hollywood    4.30
            San Diego    4.20
Dunkin      San Diego    4.10
            Hollywood    3.90

In [11]:
rating_means_sorted.index[0] # 'La Colombe' shop at NY

('La Colombe', 'New York')

### 3) Using a grouping of Type and Location, calculate the mean Rating for 'Chain' coffee shops in 'Hollywood'.

In [12]:
coffee_shops

     Shop_Name   Location  Rating         Type
0    Starbucks  Hollywood     4.5        Chain
1  Blue Bottle  San Diego     4.7  Independent
2       Dunkin  San Diego     4.1        Chain
3        Peets  Hollywood     4.3        Chain
4    Starbucks   New York     4.5        Chain
5   La Colombe   New York     4.8  Independent
6  Blue Bottle  Hollywood     4.6  Independent
7        Peets  San Diego     4.2        Chain
8    Starbucks   New York     4.4        Chain
9       Dunkin  Hollywood     3.9        Chain

In [13]:
coffee_shops.groupby(['Location', 'Type']).agg({'Rating': 'mean'}).loc[('Hollywood', 'Chain')]

Rating    4.233333
Name: (Hollywood, Chain), dtype: float64

### 4) Group by both Location and Type and determine the total count of each combination. Which location-type pair has the highest count?

In [14]:
coffee_shops.groupby(['Location', 'Type']).count()

                       Shop_Name  Rating
Location  Type
Hollywood Chain                3       3
          Independent          1       1
New York  Chain                2       2
          Independent          1       1
San Diego Chain                2       2
          Independent          1       1

In [15]:
coffee_shops.groupby(['Location', 'Type']).count().sort_values('Rating', ascending=False).index[0]

('Hollywood', 'Chain')

### 5) Group the data by Shop_Name and Type. For shops that appear in both 'Independent' and 'Chain' categories, which one has a higher mean rating?

In [16]:
# currently no shop is of both the categories, adding some data

In [17]:
coffee_shops.loc[9] = ['Peets', 'San fransisco', 4.6, 'Independent']

In [18]:
coffee_shops.loc[10] = ['La Colombe', 'San fransisco', 4.2, 'Chain']

In [19]:
coffee_shops

      Shop_Name       Location  Rating         Type
0     Starbucks      Hollywood     4.5        Chain
1   Blue Bottle      San Diego     4.7  Independent
2        Dunkin      San Diego     4.1        Chain
3         Peets      Hollywood     4.3        Chain
4     Starbucks       New York     4.5        Chain
5    La Colombe       New York     4.8  Independent
6   Blue Bottle      Hollywood     4.6  Independent
7         Peets      San Diego     4.2        Chain
8     Starbucks       New York     4.4        Chain
9         Peets  San fransisco     4.6  Independent
10   La Colombe  San fransisco     4.2        Chain

In [20]:
grouped = coffee_shops.groupby(['Shop_Name', 'Type'])

In [21]:
grouped = grouped['Rating'].mean()

In [22]:
mean_ratings = grouped.reset_index()

In [23]:
mean_ratings

     Shop_Name         Type    Rating
0  Blue Bottle  Independent  4.650000
1       Dunkin        Chain  4.100000
2   La Colombe        Chain  4.200000
3   La Colombe  Independent  4.800000
4        Peets        Chain  4.250000
5        Peets  Independent  4.600000
6    Starbucks        Chain  4.466667

In [24]:
mean_ratings.loc[(mean_ratings['Type'] == 'Independent') | (mean_ratings['Type'] == 'Chain')]

     Shop_Name         Type    Rating
0  Blue Bottle  Independent  4.650000
1       Dunkin        Chain  4.100000
2   La Colombe        Chain  4.200000
3   La Colombe  Independent  4.800000
4        Peets        Chain  4.250000
5        Peets  Independent  4.600000
6    Starbucks        Chain  4.466667

In [25]:
both_types = mean_ratings.groupby('Shop_Name').agg({'Type':'count', 'Rating':'max'})

In [26]:
both_types

             Type    Rating
Shop_Name
Blue Bottle     1  4.650000
Dunkin          1  4.100000
La Colombe      2  4.800000
Peets           2  4.600000
Starbucks       1  4.466667

In [27]:
both_types.loc[both_types['Type']==2]

            Type  Rating
Shop_Name
La Colombe     2     4.8
Peets          2     4.6

In [28]:
both_types = both_types.loc[both_types['Type']==2]

In [29]:
both_types

            Type  Rating
Shop_Name
La Colombe     2     4.8
Peets          2     4.6

In [30]:
both_types['Rating'].idxmax()

'La Colombe'

In [31]:
# Answer is La Colombe, the shop which is part of both types and highest avg rating.

### 6) Group by Location and Type and find out which combination has the widest range of Rating (difference between max and min).

In [32]:
def calc_range(df_group):
    return df_group.astype(float).max() - df_group.astype(float).min()

In [33]:
ratings_range = coffee_shops.groupby(['Location', 'Type']).agg({'Rating': calc_range})

In [34]:
ratings_range

                           Rating
Location      Type
Hollywood     Chain           0.2
              Independent     0.0
New York      Chain           0.1
              Independent     0.0
San Diego     Chain           0.1
              Independent     0.0
San fransisco Chain           0.0
              Independent     0.0

In [35]:
ratings_range['Rating'].idxmax()

('Hollywood', 'Chain')

### 7) By grouping based on Shop_Name and Location, determine the median rating of each combination. Which shop-location combination has the lowest median rating?

In [36]:
med_rating = coffee_shops.groupby(['Shop_Name', 'Location']).agg({'Rating':'median'})

In [37]:
med_rating

                           Rating
Shop_Name   Location
Blue Bottle Hollywood        4.60
            San Diego        4.70
Dunkin      San Diego        4.10
La Colombe  New York         4.80
            San fransisco    4.20
Peets       Hollywood        4.30
            San Diego        4.20
            San fransisco    4.60
Starbucks   Hollywood        4.50
            New York         4.45

In [38]:
med_rating['Rating'].idxmin()

('Dunkin', 'San Diego')

### 8) Group by both Type and Location, and determine the total sum of ratings for 'Independent' coffee shops across all locations.

In [39]:
sum_ratings = coffee_shops.groupby(['Type','Location']).agg({'Rating':'sum'})

In [40]:
sum_ratings

                           Rating
Type        Location
Chain       Hollywood         8.8
            New York          8.9
            San Diego         8.3
            San fransisco     4.2
Independent Hollywood         4.6
            New York          4.8
            San Diego         4.7
            San fransisco     4.6

In [41]:
sum_ratings.loc['Independent'].sum()

Rating    18.7
dtype: float64

### 9) Group the DataFrame by Location and Shop_Name. Which location has the most diverse set of coffee shops in terms of the number of unique shop names?

In [42]:
unique_values_by_loc = coffee_shops.groupby(['Location']).nunique()

In [43]:
unique_values_by_loc

               Shop_Name  Rating  Type
Location
Hollywood              3       3     2
New York               2       3     2
San Diego              3       3     2
San fransisco          2       2     2

In [44]:
unique_values_by_loc.loc[:, 'Shop_Name'].sort_values(ascending=False)

Location
Hollywood        3
San Diego        3
New York         2
San fransisco    2
Name: Shop_Name, dtype: int64

In [45]:
# Hollywood and San Diego locations

### 10) After grouping by Type and Shop_Name, which 'Chain' coffee shop has the highest average rating and where is it located?

In [46]:
mean_ratings = coffee_shops.groupby(['Type', 'Shop_Name']).agg({'Rating':'mean', 'Location':lambda x : x})

In [47]:
mean_ratings

                           Rating                         Location
Type        Shop_Name
Chain       Dunkin       4.100000                        San Diego
            La Colombe   4.200000                    San fransisco
            Peets        4.250000           [Hollywood, San Diego]
            Starbucks    4.466667  [Hollywood, New York, New York]
Independent Blue Bottle  4.650000           [San Diego, Hollywood]
            La Colombe   4.800000                         New York
            Peets        4.600000                    San fransisco

In [48]:
mean_ratings.sort_values('Rating', ascending=False)

                           Rating                         Location
Type        Shop_Name
Independent La Colombe   4.800000                         New York
            Blue Bottle  4.650000           [San Diego, Hollywood]
            Peets        4.600000                    San fransisco
Chain       Starbucks    4.466667  [Hollywood, New York, New York]
            Peets        4.250000           [Hollywood, San Diego]
            La Colombe   4.200000                    San fransisco
            Dunkin       4.100000                        San Diego

In [49]:
mean_ratings.sort_values('Rating', ascending=False).loc['Chain']

              Rating                         Location
Shop_Name
Starbucks   4.466667  [Hollywood, New York, New York]
Peets       4.250000           [Hollywood, San Diego]
La Colombe  4.200000                    San fransisco
Dunkin      4.100000                        San Diego

In [52]:
mean_ratings

                           Rating                         Location
Type        Shop_Name
Chain       Dunkin       4.100000                        San Diego
            La Colombe   4.200000                    San fransisco
            Peets        4.250000           [Hollywood, San Diego]
            Starbucks    4.466667  [Hollywood, New York, New York]
Independent Blue Bottle  4.650000           [San Diego, Hollywood]
            La Colombe   4.800000                         New York
            Peets        4.600000                    San fransisco

In [53]:
mean_ratings.sort_values('Rating', ascending=False).loc['Chain']

              Rating                         Location
Shop_Name
Starbucks   4.466667  [Hollywood, New York, New York]
Peets       4.250000           [Hollywood, San Diego]
La Colombe  4.200000                    San fransisco
Dunkin      4.100000                        San Diego

In [64]:
df_copy = mean_ratings.sort_values('Rating', ascending=False).loc['Chain']

In [65]:
df_copy

              Rating                         Location
Shop_Name
Starbucks   4.466667  [Hollywood, New York, New York]
Peets       4.250000           [Hollywood, San Diego]
La Colombe  4.200000                    San fransisco
Dunkin      4.100000                        San Diego

In [67]:
df_copy.iloc[0]

Rating                             4.466667
Location    [Hollywood, New York, New York]
Name: Starbucks, dtype: object